waveshareteam/ESP32-P4-WIFI6-Touch-LCD-7B/examples/esp-idf/05_wifistation/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# CONFIG_ESP32P4_SELECTS_REV_LESS_V3 is not set
CONFIG_ESP32P4_REV_MIN_300=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
